Repository: vault19/django-courses
Catalog: courses/locale/*/LC_MESSAGES/django.po
Languages: sk

source: Course Runs
sk: Termíny kurzu

source: %(count)d Chapter
sk: %(count)d Kapitola

source: Chapter
sk: Kapitola

source: %(count)d Lecture
sk: %(count)d Lekcia

source: Lectures
sk: Lekcie

source: %(count)d Submission
sk: %(count)d Zadanie

source: Submissions
sk: Zadania

source: %(count)d User
sk: %(count)d Používateľ

source: Users
sk: Používatelia

source: %(count)d Review
sk: %(count)d Recenzia

source: Reviews
sk: Recenzie

source: Specified coupon is not valid yet.
sk: Zadaný kód ešte nie je platný.

source: A discount has already been applied to this registration.
sk: Pre túto registráciu už bol použitý zľavový kód.

source: You are not subscribed to this course!
sk: Nie ste prihlásený na tento kurz!

source: You need to finish the payment in order to continue to the course.
sk: Aby ste mohli pokračovať na kurz, musíte zrealizovať platbu.

source: Run
sk: Termín

source: Discount Code
sk: Zľavový kód

source: Draft
sk: Rozpracovaný

source: Open
sk: Otvorený

source: Closed
sk: Zatvorený

source: Private
sk: Súkromný

source: Video Lesson
sk: Video lekcia

source: Text to read
sk: Text na čítanie

source: Peer Feedback
sk: Spätná väzba

source: Project
sk: Projekt

source: Feedback
sk: Spätná väzba

source: Live lesson
sk: Živá lekcia

source: Disabled
sk: Zablokované

source: Not required
sk: Nepovinné

source: Required for next chapter
sk: Povinné pre odomknutie ďalšej kapitoly

source: Required to end course
sk: Povinné pre ukončenie kurzu

source: Title
sk: Nadpis

source: Course
sk: Kurz

source: Courses
sk: Kurzy

source: Short description of the course displayed in the list of all courses. If empty description will be used.
sk: Krátky popis kurzu zobrazeného v zozname kurzov. Ak je nevyplnený, použije sa popis.

source: Description
sk: Popis

source: Full description of the course.
sk: Plný popis kurzu.

source: State
sk: Stav

source: Metadata
sk: Metadáta

source: Metadata about course.
sk: Metadata o kurze.

source: Creator
sk: Tvorca

source: Creator of the course, mainly responsible for the content
sk: Autor kurzu, prevažne zodpovedný za obsah

source: Chapters
sk: Kapitoly

source: Previous chapter
sk: Predchádzajúca kapitola

source: Short description of the chapter displayed in the list of all chapters.
sk: Krátky popis kapitoly zobrazenej v zozname všetkých kapitol

source: Full description of the chapter. Explain what will user learn in this lesson.
sk: Plný popis kapitoly. Vysvetľuje, čo sa užívateľ naučív tejto lekcii.

source: Length
sk: Dĺžka

source: Number of days that chapter will be open. If all chapters length is set to 0 course is considered self-paced.
sk: Počet dní, kedy bude táto kapitola otvorená. Ak je dĺžka všetkých kapitol nastavená na 0, kurz môže byť absolvovaný vlastným tempom.

source: Require submission
sk: Povinné zadanie

source: A submission can be required either for continuing to the next chapter or to finish the course.
sk: Na pokračovanie k ďalšej kapitole alebo ukončenie kurzu bude možno potrebné odoslať zadanie.

source: Require submission review
sk: Povinná recenzia zadania

source: Submission is accepted only after being accepted by a review.
sk: Zadanie je prijaté až po akceptovaní recenzentom.

source: Chapter has already ended...
sk: Kapitola sa už skončila...

source: Sorry it is not available any more.
sk: Ospravedlňujeme sa, obsah už nie je dostupný.

source: Chapter hasnt started yet...
sk: Kapitola sa ešte nezačala...

source: Please come back later.
sk: Prosím vráťe sa neskôr.

source: You can not link to chapter in different course!
sk: Nie je možné linkovať kapitoly z iných kurzov!

source: Lecture
sk: Lekcia

source: Subtitle
sk: Podnadpis

source: Introduce the study material, explain what data are uploaded.
sk: Predstaví študijný materiál, vysvetlí aké údaje budú nahrané.

source: Data
sk: Dáta

source: Upload study material (document, video, image).
sk: Nahrať študijný materiál (dokument, video, obrázok).

source: Metadata about uploaded data.
sk: Metadáta o nahratých dátach.

source: Lecture type
sk: Typ lekcie

source: Order number for the lecture in the chapter.
sk: Poradové číslo lekcie v kapitole.

source: Lecture type is "%(lecture_type)s" but you are not uploading such file. Allowed extensions: %(file_format)s
sk: Typ prednášky je "%(lecture_type)s" ale nenahrali ste súbor tohto typu. Povolené typy: %(file_format)s

source: Course Run
sk: Termín kurzu

source: Short description displayed in course list, use as course perex. If empty course perex will be used.
sk: Krátky popis zobrazený v zozname kurzov, použite ako perex kurzu. Pri prázdnom kurze sa použije perex.

source: Start
sk: Začiatok

source: End
sk: Koniec

source: Date will be calculated automatically if any of the chapter has length set.
sk: Dátum bude vypočítaný automaticky ak má aspoň jedna kapitola nastavenú dĺžku.

source: Price
sk: Cena

source: Price for the course run that will have to be payed by the subscriber.
sk: Cena kurzu, ktorá musí byť zaplatená predplatiteľom.

source: Max number of attendees, after which registration for the Run will close. If set to 0 the course will have no limit.
sk: Maximálny počet účastníkov, po prekročení sa registrácia na termín uzavrie. Ak je nastavená na 0, kurz nemá obmedzený počet účastníkov.

source: Metadata about run.
sk: Metadata o behu.

source: Manager
sk: Manažér

source: Manager of the course run, responsible for the smoothness of the run.
sk: Manažér kurzu, zodpovedný za bezproblémový priebeh kurzu.

source: Frequently asked question
sk: Časté otázky

source: Frequently asked questions
sk: Časté otázky

source: Subscription Level
sk: Úroveň registrácie

source: Subscription Levels
sk: Úroveňe registrácie

source: Full description of the subscription level.
sk: Plný popis registráčnej úrovne.

source: Run User
sk: Termín Používateľa

source: Run Users
sk: Termíny Používateľov

source: User
sk: Používateľ

source: Payment
sk: Platba

source: Added
sk: Pridané

source: Modified
sk: Modifikované

source: Meeting
sk: Stretnutie

source: Meetings
sk: Spoločné stretnutia

source: Metadata about meeting.
sk: Metadata o stretnutí.

source: Leader
sk: Vedúci

source: Leader of the meeting, eg. lecturer, vip...
sk: Vedúci stretnutia, napr. prednášajúci, vip...

source: Organizer
sk: Organizátor

source: Organizer of the meeting, responsible for the meeting.
sk: Organizátor stretnutia, ktorý je zodpovedný za priebeh stretnutia.

source: Meeting can not finish before it has started.
sk: Stretnutie nemôže skončiť skôr, ako začne.

source: Meeting is scheduled before the lecture's chapter starts: {start}.
sk: Stretnutie je naplánované pred začiatkom kapitoly: {start}.

source: Meeting is scheduled after the lecture's chapter is already finished: {end}.
sk: Stretnutie je naplánované po ukončení kapitoly: {end}.

source: Meeting can not end after the lecture's chapter is already finished: {end}.
sk: Stetnutie nemôže končiť po ukončení kapitoly: {end}.

source: Submission
sk: Zadanie

source: Describe what you have learned.
sk: Popíšte, čo ste sa naučili.

source: Attachment
sk: Príloha

source: Upload an attachment.
sk: Nahrajte prílohu

source: Image
sk: Obrázok

source: Upload an image of your work.
sk: Nahrajte obrázok vášho projektu.

source: Author
sk: Autor

source: Metadata about submission.
sk: Metadata o zadaní.

source: Selected chapter does not belong to submission's course.
sk: Vybraná kapitola nepatrí do kurzu zadania.

source: Selected lecture does not belong to selected chapter.
sk: Vybraná lekcia nepatrí do vybranej kapitoly.

source: Selected lecture does not belong to submission's course.
sk: Vybraná lekcia nepatrí do kurzu zadania.

source: Review
sk: Recenzia

source: Describe your opinion about the submission.
sk: Napíšte svoj názor na zadanie.

source: Accepted
sk: Akceptované

source: Check if the submission if acceptable. If not, the reviewee will have to submit a new submission.
sk: Skontrolujte či je nové zadanie v poriadku. Ak nie, podateľ bude musí odoslať nové zadanie.

source: You can not review your own submission!
sk: Nie je možné recenzovať vlastné zadania!

source: Certificate
sk: Certifikát

source: Certificates
sk: Certifikáty

source: View
sk: Pozrieť

source: Subscribed
sk: Registrovaný

source: Remains
sk: Ostáva

source: Ended
sk: Ukončené

source: Self-paced
sk: Vlastné tempo

source: Close
sk: Zavrieť

source: Submit
sk: Odovzdať

source: Course Chapters
sk: Kapitoly kurzu

source: Chapter Submission
sk: Zadanie pre kapitolu

source: Chapter Lectures
sk: Lekcie kapitoly

source: Previous lecture
sk: Predchádzajúca lekcia

source: Next lecture
sk: Nasledujúca lekcia

source: Subscribe
sk: Záväzne sa registrovať

source: Price:
sk: Cena:

source: No active runs
sk: Žiadne termíny

source: You are going to unsubscribe from the course:
sk: Chystáte sa odhlásiť z kurzu:

source: You are going to subscribe to the course:
sk: Práve sa idete záväzne registrovať na kurz:

source: Unsubscribe
sk: Odhlásiť

source: Submitted Review
sk: Odovzdaná Recenzia

source: Rejected
sk: Odmietnutá

source: Edit Review
sk: Zmeniť Recenziu

source: Review Submission
sk: Recenzovať Zadanie

source: Save changes
sk: Uložiť zmeny

source: My Submission
sk: Moje zadanie

source: Edit
sk: Zmeniť

source: Watched
sk: Pozreté

source: Meeting link
sk: Link na stretnutie

source: Submitted Submission
sk: Odovzdané Zadanie

source: Edit Submitted Submission
sk: Zmeniť Odovzdané Zadanie

source: You have not submitted anything...
sk: Ešte ste neodovzdali zadanie...

source: Submit Submission
sk: Odovzdať Zadanie

source: Submit Review
sk: Odovzdať Recenziu

source: First Name
sk: Meno

source: Last Name
sk: Priezvisko

source: Viewed
sk: Pozreté

source: You can use following options to make a payment for the course:
sk: Môžete použiť nasledujúce možnosti platby za kurz:

source: Your subscriptions:
sk: Vaša úroveňe registrácie:

source: View Certificate
sk: Zobraziť Certifikát

source: Generate Certificate
sk: Generovať Certifikát

source: Generate
sk: Generovať

source: Atendees
sk: Účastníci

source: unlocks in %(time)s
sk: odomkne sa o %(time)s

source: %(time)s ago
sk: pred %(time)s

source: The maximum file size that can be uploaded is %(limit_value)s MB.
sk: Maximálna veľkosť súboru, ktorý môžete nahrať je %(limit_value)s MB.

source: Open courses
sk: Prebiehajúce kurzy

source: Subscribed courses
sk: Registrované kurzy

source: Subscribed closed courses
sk: Registrované ukončené kurzy

source: You are not allowed to visit this page.
sk: Nemáte oprávnenie prezerať túto strnánku.

source: Closed courses
sk: Ukončené kurzy

source: Submission is not allowed.
sk: Zadania nie sú povolené.

source: Your submission has been saved.
sk: Vaše zadanie bolo uložené.

source: Please correct form errors.
sk: Prosím opravte chyby vo formuláry.

source: Videos
sk: Videá

source: My group
sk: Moja skupina

source: Review Courses
sk: Recenzie Kurzov

source: Attendees
sk: Účastníci

source: Your review has been saved.
sk: Vaša recenzia bola uložená.

source: You are already subscribed to course: %(run)s.
sk: Už ste zaregistrovaný na kurz: %(run)s.

source: Subscription levels
sk: Úroveňe registrácie

source: We have received %(payment)s of %(price)s EUR. Enjoy your course.
sk: Prijali sme platbu %(payment)s z %(price)s EUR.

source: Payment instructions
sk: Platobné inštrukcie

source: The specified coupon does not exist.
sk: Zadaný zľavový kód neexistuje.

source: The specified coupon is not valid.
sk: Zadaný zľavový kód nie je platný.

source: Thank you for your payment.
sk: Ďakujeme za vašu platbu.

source: Subscribed user's limit has been reached.
sk: Naplnil sa počet prihásených ľudí.

source: You are not allowed to subscribe to course that has already started.
sk: Nie je možné prihlásiť sa do kurzu ktorý sa už začal.

source: You are not allowed to subscribe to course that has already finished.
sk: Nie je možné prihlásiť sa do kurzu ktorý sa už skončil.

source: You are already subscribed in different course run.
sk: Už ste zaregistrovaný v inom termíne na tento kurz.

source: Please correct errors in your subscription form.
sk: Prosím opravte chyby vo Vašom registráčnom formuláry.

source: You have been subscribed to course: %(run)s.
sk: Boli ste registrovaný na kurz: %(run)s.

source: You need to submit subscription form in order to subscribe!
sk: Na registráciu musíte odoslať registračný formulár!

source: You are not allowed to unsubscribe from the course: %(run)s.
sk: Nie je možné odhlásiť sa z kurzu: %(run)s.

source: You have been unsubscribed from course: %(run)s.
sk: Boli ste odhlásený z kurzu: %(run)s.

source: You are not subscribed to the course: %(run)s.
sk: Nie ste prihlásený na kurz: %(run)s.

source: You need to submit subscription form in order to unsubscribe!
sk: Na odhlásenie musíte odoslať registračný formulár!
